Extra Lectures for DPL - Data Cleaning

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("C:/Users/Sanskar/Downloads/movie scores.csv")
data

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [3]:
data.isnull()
# null values are indicated by boolean logic

   first_name  last_name    age  Gender  pre_movie_score  post_movie_score
0       False      False  False   False            False             False
1        True       True   True    True             True              True
2       False      False  False   False             True              True
3       False      False  False   False            False             False
4       False      False  False   False            False             False

In [4]:
data.notnull()
# reverses the logic

   first_name  last_name    age  Gender  pre_movie_score  post_movie_score
0        True       True   True    True             True              True
1       False      False  False   False            False             False
2        True       True   True    True            False             False
3        True       True   True    True             True              True
4        True       True   True    True             True              True

In [5]:
data['first_name']

0     Root
1      NaN
2    Stark
3    Sofie
4     Emma
Name: first_name, dtype: object

In [6]:
data['first_name'].notnull()

0     True
1    False
2     True
3     True
4     True
Name: first_name, dtype: bool

In [7]:
data[data['first_name'].notnull()]
# To see dataframe for only the given names

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [8]:
data[data['pre_movie_score'].isnull() & data['Gender'].notnull()]

  first_name last_name   age Gender  pre_movie_score  post_movie_score
2      Stark      Mike  48.0      m              NaN               NaN

In [9]:
data[data['pre_movie_score'].isnull() | data['Gender'].notnull()]

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [10]:
# Missing value count each column
data.isna().sum()

first_name          1
last_name           1
age                 1
Gender              1
pre_movie_score     2
post_movie_score    2
dtype: int64

In [11]:
# Total missing value count
data.isna().sum().sum()

8

In [12]:
# To remove NaN values
data.dropna()

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [13]:
# To remove NaN along columns
data.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [14]:
# Keep rows with at least one not-null value
data.dropna(thresh = 1)

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [15]:
data.dropna(thresh = 4, axis = 1)

  first_name last_name   age Gender
0       Root      Joss  36.0      m
1        NaN       NaN   NaN    NaN
2      Stark      Mike  48.0      m
3      Sofie    Miller  39.0      f
4       Emma       Roy  84.0      f

In [16]:
# To replace NaN values
data.fillna("NEW")

  first_name last_name   age Gender pre_movie_score post_movie_score
0       Root      Joss  36.0      m             8.0              9.0
1        NEW       NEW   NEW    NEW             NEW              NEW
2      Stark      Mike  48.0      m             NEW              NEW
3      Sofie    Miller  39.0      f             7.0              8.0
4       Emma       Roy  84.0      f             6.0              8.0

In [17]:
data['first_name'] = data['first_name'].fillna("Empty")

In [18]:
data

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1      Empty       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [19]:
data['pre_movie_score'].mean()

7.0

In [20]:
data['pre_movie_score'].fillna(data['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    7.0
4    6.0
Name: pre_movie_score, dtype: float64

In [21]:
data['pre_movie_score'].fillna(data['pre_movie_score'].median())

0    8.0
1    7.0
2    7.0
3    7.0
4    6.0
Name: pre_movie_score, dtype: float64